TRUNCATE TABLE Exercises;
GO




INSERT INTO Exercises (Name, Category, MuscleGroup)
VALUES

    ('Жим штанги лежа', 'Грудь', 'Грудные мышцы'),
	('Отжимания на брусьях', 'Грудь', 'Грудные мышцы + Трицепс'),
	('Разводка гантелей', 'Грудь', 'Грудные мышцы'),


	('Приседания со штангой', 'Ноги', 'Квадрицепсы + Ягодицы'),
	('Румынская тяга', 'Ноги', 'Бицепс бедра'),
	('Жим ногами', 'Ноги', 'Квадрицепс'),

	('Тяга штанги в наклоне', 'Спина', 'Широчайшие мышцы'),
	('Подтягивания', 'Спина', 'Широчайшие мышцы + Бицепс'),
	('Тяга верхнего блока', 'Спина', 'Широчайшие мышцы'),

	('Жим штанги стоя', 'Плечи', 'Дельтовидные мышцы'),
	('Махи гантелями', 'Плечи', 'Дельтовидные мышцы'),

	('Сгибание рук со штангой', 'Руки', 'Бицепс'),
	('Французский жим', 'Руки', 'Трицепс');
GO


SELECT Id, Name, Category, MuscleGroup
FROM Exercises
ORDER BY Name;
GO

SELECT COUNT (*) AS TotalExercises FROM Exercises;
GO